In [1]:
import pandas as pd

In [16]:
df = pd.DataFrame(
{"a" : [4, 5, 6],
"b" : [7, 8, 9],
"c" : [10, 11, 12]},
index = [1, 2, 3])
display(df)

n=2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [6]:
#Select last n rows.
df.tail(n)

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [9]:
#Extract rows that meet logical criteria.
df[df.a > 1]

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [10]:
#Remove duplicate rows (only considers columns).
df.drop_duplicates()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [11]:
#Randomly select fraction of rows.
df.sample(frac=0.5)

   a  b   c
1  4  7  10
2  5  8  11

In [13]:
#Randomly select n rows.
df.sample(n=2)

   a  b   c
1  4  7  10
2  5  8  11

In [18]:
#Select and order top n entries.
#df.nlargest(n, 'a')

   a  b   c
3  6  9  12
2  5  8  11

In [19]:
#Select and order bottom n entries.
df.nsmallest(n, 'a')

   a  b   c
1  4  7  10
2  5  8  11

In [20]:
#Select first n rows.
df.head(n)

   a  b   c
1  4  7  10
2  5  8  11

In [21]:
#Select last n rows.
df.tail(n)

   a  b   c
2  5  8  11
3  6  9  12